SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_timer.h
/* Bit fields for TIMER CTRL */
#define _TIMER_CTRL_RESETVALUE                  0x00000000UL                            /**< Default value for TIMER_CTRL                */
#define _TIMER_CTRL_MASK                        0x0000001FUL                            /**< Mask for TIMER_CTRL                         */
#define _TIMER_CTRL_RISEA_SHIFT                 0                                       /**< Shift value for TIMER_RISEA                 */
#define _TIMER_CTRL_RISEA_MASK                  0x3UL                                   /**< Bit mask for TIMER_RISEA                    */
#define _TIMER_CTRL_RISEA_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_CTRL                 */
#define _TIMER_CTRL_RISEA_NONE                  0x00000000UL                            /**< Mode NONE for TIMER_CTRL                    */
#define _TIMER_CTRL_RISEA_START                 0x00000001UL                            /**< Mode START for TIMER_CTRL                   */
#define _TIMER_CTRL_RISEA_STOP                  0x00000002UL                            /**< Mode STOP for TIMER_CTRL                    */
#define _TIMER_CTRL_RISEA_RELOADSTART           0x00000003UL                            /**< Mode RELOADSTART for TIMER_CTRL             */
#define TIMER_CTRL_RISEA_DEFAULT                (_TIMER_CTRL_RISEA_DEFAULT << 0)        /**< Shifted mode DEFAULT for TIMER_CTRL         */
#define TIMER_CTRL_RISEA_NONE                   (_TIMER_CTRL_RISEA_NONE << 0)           /**< Shifted mode NONE for TIMER_CTRL            */
#define TIMER_CTRL_RISEA_START                  (_TIMER_CTRL_RISEA_START << 0)          /**< Shifted mode START for TIMER_CTRL           */
#define TIMER_CTRL_RISEA_STOP                   (_TIMER_CTRL_RISEA_STOP << 0)           /**< Shifted mode STOP for TIMER_CTRL            */
#define TIMER_CTRL_RISEA_RELOADSTART            (_TIMER_CTRL_RISEA_RELOADSTART << 0)    /**< Shifted mode RELOADSTART for TIMER_CTRL     */
#define _TIMER_CTRL_FALLA_SHIFT                 2                                       /**< Shift value for TIMER_FALLA                 */
#define _TIMER_CTRL_FALLA_MASK                  0xCUL                                   /**< Bit mask for TIMER_FALLA                    */
#define _TIMER_CTRL_FALLA_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_CTRL                 */
#define _TIMER_CTRL_FALLA_NONE                  0x00000000UL                            /**< Mode NONE for TIMER_CTRL                    */
#define _TIMER_CTRL_FALLA_START                 0x00000001UL                            /**< Mode START for TIMER_CTRL                   */
#define _TIMER_CTRL_FALLA_STOP                  0x00000002UL                            /**< Mode STOP for TIMER_CTRL                    */
#define _TIMER_CTRL_FALLA_RELOADSTART           0x00000003UL                            /**< Mode RELOADSTART for TIMER_CTRL             */
#define TIMER_CTRL_FALLA_DEFAULT                (_TIMER_CTRL_FALLA_DEFAULT << 2)        /**< Shifted mode DEFAULT for TIMER_CTRL         */
#define TIMER_CTRL_FALLA_NONE                   (_TIMER_CTRL_FALLA_NONE << 2)           /**< Shifted mode NONE for TIMER_CTRL            */
#define TIMER_CTRL_FALLA_START                  (_TIMER_CTRL_FALLA_START << 2)          /**< Shifted mode START for TIMER_CTRL           */
#define TIMER_CTRL_FALLA_STOP                   (_TIMER_CTRL_FALLA_STOP << 2)           /**< Shifted mode STOP for TIMER_CTRL            */
#define TIMER_CTRL_FALLA_RELOADSTART            (_TIMER_CTRL_FALLA_RELOADSTART << 2)    /**< Shifted mode RELOADSTART for TIMER_CTRL     */
#define TIMER_CTRL_X2CNT                        (0x1UL << 4)                            /**< 2x Count Mode                               */
#define _TIMER_CTRL_X2CNT_SHIFT                 4                                       /**< Shift value for TIMER_X2CNT                 */
#define _TIMER_CTRL_X2CNT_MASK                  0x10UL                                  /**< Bit mask for TIMER_X2CNT                    */
#define _TIMER_CTRL_X2CNT_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_CTRL                 */
#define TIMER_CTRL_X2CNT_DEFAULT                (_TIMER_CTRL_X2CNT_DEFAULT << 4)        /**< Shifted mode DEFAULT for TIMER_CTRL         */

/* Bit fields for TIMER CMD */
#define _TIMER_CMD_RESETVALUE                   0x00000000UL                            /**< Default value for TIMER_CMD                 */
#define _TIMER_CMD_MASK                         0x00000003UL                            /**< Mask for TIMER_CMD                          */
#define TIMER_CMD_START                         (0x1UL << 0)                            /**< Start Timer                                 */
#define _TIMER_CMD_START_SHIFT                  0                                       /**< Shift value for TIMER_START                 */
#define _TIMER_CMD_START_MASK                   0x1UL                                   /**< Bit mask for TIMER_START                    */
#define _TIMER_CMD_START_DEFAULT                0x00000000UL                            /**< Mode DEFAULT for TIMER_CMD                  */
#define TIMER_CMD_START_DEFAULT                 (_TIMER_CMD_START_DEFAULT << 0)         /**< Shifted mode DEFAULT for TIMER_CMD          */
#define TIMER_CMD_STOP                          (0x1UL << 1)                            /**< Stop Timer                                  */
#define _TIMER_CMD_STOP_SHIFT                   1                                       /**< Shift value for TIMER_STOP                  */
#define _TIMER_CMD_STOP_MASK                    0x2UL                                   /**< Bit mask for TIMER_STOP                     */
#define _TIMER_CMD_STOP_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for TIMER_CMD                  */
#define TIMER_CMD_STOP_DEFAULT                  (_TIMER_CMD_STOP_DEFAULT << 1)          /**< Shifted mode DEFAULT for TIMER_CMD          */

