SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG23/Include/efr32sg23_timer.h
/* Bit fields for TIMER STATUS */
#define _TIMER_STATUS_RESETVALUE                0x00000000UL                            /**< Default value for TIMER_STATUS              */
#define _TIMER_STATUS_MASK                      0x07070777UL                            /**< Mask for TIMER_STATUS                       */
#define TIMER_STATUS_RUNNING                    (0x1UL << 0)                            /**< Running                                     */
#define _TIMER_STATUS_RUNNING_SHIFT             0                                       /**< Shift value for TIMER_RUNNING               */
#define _TIMER_STATUS_RUNNING_MASK              0x1UL                                   /**< Bit mask for TIMER_RUNNING                  */
#define _TIMER_STATUS_RUNNING_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define TIMER_STATUS_RUNNING_DEFAULT            (_TIMER_STATUS_RUNNING_DEFAULT << 0)    /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_DIR                        (0x1UL << 1)                            /**< Direction                                   */
#define _TIMER_STATUS_DIR_SHIFT                 1                                       /**< Shift value for TIMER_DIR                   */
#define _TIMER_STATUS_DIR_MASK                  0x2UL                                   /**< Bit mask for TIMER_DIR                      */
#define _TIMER_STATUS_DIR_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define _TIMER_STATUS_DIR_UP                    0x00000000UL                            /**< Mode UP for TIMER_STATUS                    */
#define _TIMER_STATUS_DIR_DOWN                  0x00000001UL                            /**< Mode DOWN for TIMER_STATUS                  */
#define TIMER_STATUS_DIR_DEFAULT                (_TIMER_STATUS_DIR_DEFAULT << 1)        /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_DIR_UP                     (_TIMER_STATUS_DIR_UP << 1)             /**< Shifted mode UP for TIMER_STATUS            */
#define TIMER_STATUS_DIR_DOWN                   (_TIMER_STATUS_DIR_DOWN << 1)           /**< Shifted mode DOWN for TIMER_STATUS          */
#define TIMER_STATUS_TOPBV                      (0x1UL << 2)                            /**< TOP Buffer Valid                            */
#define _TIMER_STATUS_TOPBV_SHIFT               2                                       /**< Shift value for TIMER_TOPBV                 */
#define _TIMER_STATUS_TOPBV_MASK                0x4UL                                   /**< Bit mask for TIMER_TOPBV                    */
#define _TIMER_STATUS_TOPBV_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define TIMER_STATUS_TOPBV_DEFAULT              (_TIMER_STATUS_TOPBV_DEFAULT << 2)      /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_TIMERLOCKSTATUS            (0x1UL << 4)                            /**< Timer lock status                           */
#define _TIMER_STATUS_TIMERLOCKSTATUS_SHIFT     4                                       /**< Shift value for TIMER_TIMERLOCKSTATUS       */
#define _TIMER_STATUS_TIMERLOCKSTATUS_MASK      0x10UL                                  /**< Bit mask for TIMER_TIMERLOCKSTATUS          */
#define _TIMER_STATUS_TIMERLOCKSTATUS_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define _TIMER_STATUS_TIMERLOCKSTATUS_UNLOCKED  0x00000000UL                            /**< Mode UNLOCKED for TIMER_STATUS              */
#define _TIMER_STATUS_TIMERLOCKSTATUS_LOCKED    0x00000001UL                            /**< Mode LOCKED for TIMER_STATUS                */
#define TIMER_STATUS_TIMERLOCKSTATUS_DEFAULT    (_TIMER_STATUS_TIMERLOCKSTATUS_DEFAULT << 4) /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_TIMERLOCKSTATUS_UNLOCKED   (_TIMER_STATUS_TIMERLOCKSTATUS_UNLOCKED << 4) /**< Shifted mode UNLOCKED for TIMER_STATUS      */
#define TIMER_STATUS_TIMERLOCKSTATUS_LOCKED     (_TIMER_STATUS_TIMERLOCKSTATUS_LOCKED << 4) /**< Shifted mode LOCKED for TIMER_STATUS        */
#define TIMER_STATUS_DTILOCKSTATUS              (0x1UL << 5)                            /**< DTI lock status                             */
#define _TIMER_STATUS_DTILOCKSTATUS_SHIFT       5                                       /**< Shift value for TIMER_DTILOCKSTATUS         */
#define _TIMER_STATUS_DTILOCKSTATUS_MASK        0x20UL                                  /**< Bit mask for TIMER_DTILOCKSTATUS            */
#define _TIMER_STATUS_DTILOCKSTATUS_DEFAULT     0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define _TIMER_STATUS_DTILOCKSTATUS_UNLOCKED    0x00000000UL                            /**< Mode UNLOCKED for TIMER_STATUS              */
#define _TIMER_STATUS_DTILOCKSTATUS_LOCKED      0x00000001UL                            /**< Mode LOCKED for TIMER_STATUS                */
#define TIMER_STATUS_DTILOCKSTATUS_DEFAULT      (_TIMER_STATUS_DTILOCKSTATUS_DEFAULT << 5) /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_DTILOCKSTATUS_UNLOCKED     (_TIMER_STATUS_DTILOCKSTATUS_UNLOCKED << 5) /**< Shifted mode UNLOCKED for TIMER_STATUS      */
#define TIMER_STATUS_DTILOCKSTATUS_LOCKED       (_TIMER_STATUS_DTILOCKSTATUS_LOCKED << 5) /**< Shifted mode LOCKED for TIMER_STATUS        */
#define TIMER_STATUS_SYNCBUSY                   (0x1UL << 6)                            /**< Sync Busy                                   */
#define _TIMER_STATUS_SYNCBUSY_SHIFT            6                                       /**< Shift value for TIMER_SYNCBUSY              */
#define _TIMER_STATUS_SYNCBUSY_MASK             0x40UL                                  /**< Bit mask for TIMER_SYNCBUSY                 */
#define _TIMER_STATUS_SYNCBUSY_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define TIMER_STATUS_SYNCBUSY_DEFAULT           (_TIMER_STATUS_SYNCBUSY_DEFAULT << 6)   /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_OCBV0                      (0x1UL << 8)                            /**< Output Compare Buffer Valid                 */
#define _TIMER_STATUS_OCBV0_SHIFT               8                                       /**< Shift value for TIMER_OCBV0                 */
#define _TIMER_STATUS_OCBV0_MASK                0x100UL                                 /**< Bit mask for TIMER_OCBV0                    */
#define _TIMER_STATUS_OCBV0_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define TIMER_STATUS_OCBV0_DEFAULT              (_TIMER_STATUS_OCBV0_DEFAULT << 8)      /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_OCBV1                      (0x1UL << 9)                            /**< Output Compare Buffer Valid                 */
#define _TIMER_STATUS_OCBV1_SHIFT               9                                       /**< Shift value for TIMER_OCBV1                 */
#define _TIMER_STATUS_OCBV1_MASK                0x200UL                                 /**< Bit mask for TIMER_OCBV1                    */
#define _TIMER_STATUS_OCBV1_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define TIMER_STATUS_OCBV1_DEFAULT              (_TIMER_STATUS_OCBV1_DEFAULT << 9)      /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_OCBV2                      (0x1UL << 10)                           /**< Output Compare Buffer Valid                 */
#define _TIMER_STATUS_OCBV2_SHIFT               10                                      /**< Shift value for TIMER_OCBV2                 */
#define _TIMER_STATUS_OCBV2_MASK                0x400UL                                 /**< Bit mask for TIMER_OCBV2                    */
#define _TIMER_STATUS_OCBV2_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define TIMER_STATUS_OCBV2_DEFAULT              (_TIMER_STATUS_OCBV2_DEFAULT << 10)     /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_ICFEMPTY0                  (0x1UL << 16)                           /**< Input capture fifo empty                    */
#define _TIMER_STATUS_ICFEMPTY0_SHIFT           16                                      /**< Shift value for TIMER_ICFEMPTY0             */
#define _TIMER_STATUS_ICFEMPTY0_MASK            0x10000UL                               /**< Bit mask for TIMER_ICFEMPTY0                */
#define _TIMER_STATUS_ICFEMPTY0_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define TIMER_STATUS_ICFEMPTY0_DEFAULT          (_TIMER_STATUS_ICFEMPTY0_DEFAULT << 16) /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_ICFEMPTY1                  (0x1UL << 17)                           /**< Input capture fifo empty                    */
#define _TIMER_STATUS_ICFEMPTY1_SHIFT           17                                      /**< Shift value for TIMER_ICFEMPTY1             */
#define _TIMER_STATUS_ICFEMPTY1_MASK            0x20000UL                               /**< Bit mask for TIMER_ICFEMPTY1                */
#define _TIMER_STATUS_ICFEMPTY1_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define TIMER_STATUS_ICFEMPTY1_DEFAULT          (_TIMER_STATUS_ICFEMPTY1_DEFAULT << 17) /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_ICFEMPTY2                  (0x1UL << 18)                           /**< Input capture fifo empty                    */
#define _TIMER_STATUS_ICFEMPTY2_SHIFT           18                                      /**< Shift value for TIMER_ICFEMPTY2             */
#define _TIMER_STATUS_ICFEMPTY2_MASK            0x40000UL                               /**< Bit mask for TIMER_ICFEMPTY2                */
#define _TIMER_STATUS_ICFEMPTY2_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define TIMER_STATUS_ICFEMPTY2_DEFAULT          (_TIMER_STATUS_ICFEMPTY2_DEFAULT << 18) /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_CCPOL0                     (0x1UL << 24)                           /**< Compare/Capture Polarity                    */
#define _TIMER_STATUS_CCPOL0_SHIFT              24                                      /**< Shift value for TIMER_CCPOL0                */
#define _TIMER_STATUS_CCPOL0_MASK               0x1000000UL                             /**< Bit mask for TIMER_CCPOL0                   */
#define _TIMER_STATUS_CCPOL0_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define _TIMER_STATUS_CCPOL0_LOWRISE            0x00000000UL                            /**< Mode LOWRISE for TIMER_STATUS               */
#define _TIMER_STATUS_CCPOL0_HIGHFALL           0x00000001UL                            /**< Mode HIGHFALL for TIMER_STATUS              */
#define TIMER_STATUS_CCPOL0_DEFAULT             (_TIMER_STATUS_CCPOL0_DEFAULT << 24)    /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_CCPOL0_LOWRISE             (_TIMER_STATUS_CCPOL0_LOWRISE << 24)    /**< Shifted mode LOWRISE for TIMER_STATUS       */
#define TIMER_STATUS_CCPOL0_HIGHFALL            (_TIMER_STATUS_CCPOL0_HIGHFALL << 24)   /**< Shifted mode HIGHFALL for TIMER_STATUS      */
#define TIMER_STATUS_CCPOL1                     (0x1UL << 25)                           /**< Compare/Capture Polarity                    */
#define _TIMER_STATUS_CCPOL1_SHIFT              25                                      /**< Shift value for TIMER_CCPOL1                */
#define _TIMER_STATUS_CCPOL1_MASK               0x2000000UL                             /**< Bit mask for TIMER_CCPOL1                   */
#define _TIMER_STATUS_CCPOL1_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define _TIMER_STATUS_CCPOL1_LOWRISE            0x00000000UL                            /**< Mode LOWRISE for TIMER_STATUS               */
#define _TIMER_STATUS_CCPOL1_HIGHFALL           0x00000001UL                            /**< Mode HIGHFALL for TIMER_STATUS              */
#define TIMER_STATUS_CCPOL1_DEFAULT             (_TIMER_STATUS_CCPOL1_DEFAULT << 25)    /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_CCPOL1_LOWRISE             (_TIMER_STATUS_CCPOL1_LOWRISE << 25)    /**< Shifted mode LOWRISE for TIMER_STATUS       */
#define TIMER_STATUS_CCPOL1_HIGHFALL            (_TIMER_STATUS_CCPOL1_HIGHFALL << 25)   /**< Shifted mode HIGHFALL for TIMER_STATUS      */
#define TIMER_STATUS_CCPOL2                     (0x1UL << 26)                           /**< Compare/Capture Polarity                    */
#define _TIMER_STATUS_CCPOL2_SHIFT              26                                      /**< Shift value for TIMER_CCPOL2                */
#define _TIMER_STATUS_CCPOL2_MASK               0x4000000UL                             /**< Bit mask for TIMER_CCPOL2                   */
#define _TIMER_STATUS_CCPOL2_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for TIMER_STATUS               */
#define _TIMER_STATUS_CCPOL2_LOWRISE            0x00000000UL                            /**< Mode LOWRISE for TIMER_STATUS               */
#define _TIMER_STATUS_CCPOL2_HIGHFALL           0x00000001UL                            /**< Mode HIGHFALL for TIMER_STATUS              */
#define TIMER_STATUS_CCPOL2_DEFAULT             (_TIMER_STATUS_CCPOL2_DEFAULT << 26)    /**< Shifted mode DEFAULT for TIMER_STATUS       */
#define TIMER_STATUS_CCPOL2_LOWRISE             (_TIMER_STATUS_CCPOL2_LOWRISE << 26)    /**< Shifted mode LOWRISE for TIMER_STATUS       */
#define TIMER_STATUS_CCPOL2_HIGHFALL            (_TIMER_STATUS_CCPOL2_HIGHFALL << 26)   /**< Shifted mode HIGHFALL for TIMER_STATUS      */

